Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CM5112GC00100_DFP/component/oscctrl.h
/*
 * Component description for OSCCTRL
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-07-26T17:56:39Z  */
#ifndef _PIC32CMGC00_OSCCTRL_COMPONENT_H_
#define _PIC32CMGC00_OSCCTRL_COMPONENT_H_

/* ************************************************************************** */
/*                    SOFTWARE API DEFINITION FOR OSCCTRL                     */
/* ************************************************************************** */

/* -------- OSCCTRL_EVCTRL : (OSCCTRL Offset: 0x00) (R/W 32) Event Control -------- */
#define OSCCTRL_EVCTRL_RESETVALUE             _UINT32_(0x00)                                       /*  (OSCCTRL_EVCTRL) Event Control  Reset Value */

#define OSCCTRL_EVCTRL_CFDEO_Pos              _UINT32_(0)                                          /* (OSCCTRL_EVCTRL) Clock Failure Detector Event Output Enable Position */
#define OSCCTRL_EVCTRL_CFDEO_Msk              (_UINT32_(0x1) << OSCCTRL_EVCTRL_CFDEO_Pos)          /* (OSCCTRL_EVCTRL) Clock Failure Detector Event Output Enable Mask */
#define OSCCTRL_EVCTRL_CFDEO(value)           (OSCCTRL_EVCTRL_CFDEO_Msk & (_UINT32_(value) << OSCCTRL_EVCTRL_CFDEO_Pos)) /* Assignment of value for CFDEO in the OSCCTRL_EVCTRL register */
#define OSCCTRL_EVCTRL_Msk                    _UINT32_(0x00000001)                                 /* (OSCCTRL_EVCTRL) Register Mask  */


/* -------- OSCCTRL_INTENCLR : (OSCCTRL Offset: 0x04) (R/W 32) Interrupt Enable Clear -------- */
#define OSCCTRL_INTENCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_INTENCLR) Interrupt Enable Clear  Reset Value */

#define OSCCTRL_INTENCLR_XOSCRDY_Pos          _UINT32_(0)                                          /* (OSCCTRL_INTENCLR) XOSC Ready Interrupt Enable Position */
#define OSCCTRL_INTENCLR_XOSCRDY_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_XOSCRDY_Pos)      /* (OSCCTRL_INTENCLR) XOSC Ready Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_XOSCRDY(value)       (OSCCTRL_INTENCLR_XOSCRDY_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_XOSCRDY_Pos)) /* Assignment of value for XOSCRDY in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_XOSCFAIL_Pos         _UINT32_(1)                                          /* (OSCCTRL_INTENCLR) XOSC Startup Failure Interrupt Enable Position */
#define OSCCTRL_INTENCLR_XOSCFAIL_Msk         (_UINT32_(0x1) << OSCCTRL_INTENCLR_XOSCFAIL_Pos)     /* (OSCCTRL_INTENCLR) XOSC Startup Failure Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_XOSCFAIL(value)      (OSCCTRL_INTENCLR_XOSCFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_XOSCFAIL_Pos)) /* Assignment of value for XOSCFAIL in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_CLKFAIL_Pos          _UINT32_(2)                                          /* (OSCCTRL_INTENCLR) XOSC Clock Failure Interrupt Enable Position */
#define OSCCTRL_INTENCLR_CLKFAIL_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_CLKFAIL_Pos)      /* (OSCCTRL_INTENCLR) XOSC Clock Failure Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_CLKFAIL(value)       (OSCCTRL_INTENCLR_CLKFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_CLKFAIL_Pos)) /* Assignment of value for CLKFAIL in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DFLLRDY_Pos          _UINT32_(8)                                          /* (OSCCTRL_INTENCLR) DFLL Ready Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DFLLRDY_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_DFLLRDY_Pos)      /* (OSCCTRL_INTENCLR) DFLL Ready Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DFLLRDY(value)       (OSCCTRL_INTENCLR_DFLLRDY_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DFLLRDY_Pos)) /* Assignment of value for DFLLRDY in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DFLLLOCK_Pos         _UINT32_(9)                                          /* (OSCCTRL_INTENCLR) DFLL Lock Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DFLLLOCK_Msk         (_UINT32_(0x1) << OSCCTRL_INTENCLR_DFLLLOCK_Pos)     /* (OSCCTRL_INTENCLR) DFLL Lock Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DFLLLOCK(value)      (OSCCTRL_INTENCLR_DFLLLOCK_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DFLLLOCK_Pos)) /* Assignment of value for DFLLLOCK in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DFLLOVF_Pos          _UINT32_(10)                                         /* (OSCCTRL_INTENCLR) DFLL Tuner Overflow Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DFLLOVF_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_DFLLOVF_Pos)      /* (OSCCTRL_INTENCLR) DFLL Tuner Overflow Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DFLLOVF(value)       (OSCCTRL_INTENCLR_DFLLOVF_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DFLLOVF_Pos)) /* Assignment of value for DFLLOVF in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DFLLUNF_Pos          _UINT32_(11)                                         /* (OSCCTRL_INTENCLR) DFLL Tuner Underflow Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DFLLUNF_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_DFLLUNF_Pos)      /* (OSCCTRL_INTENCLR) DFLL Tuner Underflow Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DFLLUNF(value)       (OSCCTRL_INTENCLR_DFLLUNF_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DFLLUNF_Pos)) /* Assignment of value for DFLLUNF in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DFLLRCS_Pos          _UINT32_(12)                                         /* (OSCCTRL_INTENCLR) DFLL Reference Clock Stopped Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DFLLRCS_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_DFLLRCS_Pos)      /* (OSCCTRL_INTENCLR) DFLL Reference Clock Stopped Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DFLLRCS(value)       (OSCCTRL_INTENCLR_DFLLRCS_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DFLLRCS_Pos)) /* Assignment of value for DFLLRCS in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DFLLFAIL_Pos         _UINT32_(13)                                         /* (OSCCTRL_INTENCLR) DFLL Startup Failure Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DFLLFAIL_Msk         (_UINT32_(0x1) << OSCCTRL_INTENCLR_DFLLFAIL_Pos)     /* (OSCCTRL_INTENCLR) DFLL Startup Failure Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DFLLFAIL(value)      (OSCCTRL_INTENCLR_DFLLFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DFLLFAIL_Pos)) /* Assignment of value for DFLLFAIL in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_PLL0LOCKR_Pos        _UINT32_(24)                                         /* (OSCCTRL_INTENCLR) PLL 0 Lock Rise Interrupt Enable Position */
#define OSCCTRL_INTENCLR_PLL0LOCKR_Msk        (_UINT32_(0x1) << OSCCTRL_INTENCLR_PLL0LOCKR_Pos)    /* (OSCCTRL_INTENCLR) PLL 0 Lock Rise Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_PLL0LOCKR(value)     (OSCCTRL_INTENCLR_PLL0LOCKR_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_PLL0LOCKR_Pos)) /* Assignment of value for PLL0LOCKR in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_PLL0LOCKF_Pos        _UINT32_(25)                                         /* (OSCCTRL_INTENCLR) PLL 0 Lock Fall Interrupt Enable Position */
#define OSCCTRL_INTENCLR_PLL0LOCKF_Msk        (_UINT32_(0x1) << OSCCTRL_INTENCLR_PLL0LOCKF_Pos)    /* (OSCCTRL_INTENCLR) PLL 0 Lock Fall Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_PLL0LOCKF(value)     (OSCCTRL_INTENCLR_PLL0LOCKF_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_PLL0LOCKF_Pos)) /* Assignment of value for PLL0LOCKF in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_Msk                  _UINT32_(0x03003F07)                                 /* (OSCCTRL_INTENCLR) Register Mask  */


/* -------- OSCCTRL_INTENSET : (OSCCTRL Offset: 0x08) (R/W 32) Interrupt Enable Set -------- */
#define OSCCTRL_INTENSET_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_INTENSET) Interrupt Enable Set  Reset Value */

